<?php
	date_default_timezone_set('PRC'); //默认时区
	
    $s = $_GET["s"] / 1000;
	$d = 24 * 60 * 60;
	$str = "var json = [";
	for($i = 0; $i < 7; $i++){
		$h = ($d - 14400) * rand(0,10) / 10;
    	$str .= '{"id": "id' . rand(1000, 9999) .'","cat": "组名' . rand(0, 9) . '","date": "' . date("Y/m/d", $s + $i * $d) . '","start": "' . date("H:i", $s + $i * $d + $h) . '","end": "' . date("H:i", $s + $i * $d + $h + 7200) . '","content": "' . "这两个要注意一下，我平时用两种，所以，前几天建的表，把时间类型存为日期的，我还一直用时间戳保存，一直资料写不进表，调试了好久的才知错误之处，是类型不符合，不给写入库。".substr(0, 2 * rand(10, 80)) . '"},';
		$h = ($d - 14400) * rand(0,10) / 10;
		$str .= '{"id": "id' . rand(1000, 9999) .'","cat": "组名' . rand(0, 9) . '","date": "' . date("Y/m/d", $s + $i * $d) . '","start": "' . date("H:i", $s + $i * $d + $h) . '","end": "' . date("H:i", $s + $i * $d + $h + 7200) . '","content": "' . substr("这两个要注意一下，我平时用两种，所以，前几天建的表，把时间类型存为日期的，我还一直用时间戳保存，一直资料写不进表，调试了好久的才知错误之处，是类型不符合，不给写入库。", 0, 2 * rand(10, 80)) . '"},';
	}
    $str = substr($str, 0, -1);
	echo $str . "];";
?>
